{"attrMax":0,"name":"gridcolumn","nameSpace":"cf","attributes":{"bgcolor":{"type":"string","description":"Color value for the background of the grid column, or an expression you can use to manipulate grid \n\t\tcolumn background color. Valid color entries are: black, magenta, cyan, orange, darkgray, pink, gray, \n\t\twhite (default), lightgray, yellow.","required":false},"values":{"type":"string","description":"Formats cells in the column as drop down list boxes. lets end users select an item in a drop \n\t\tdown list. Use the values attribute to specify the items you want to appear in the drop down list.","required":false},"headeralign":{"type":"string","description":"Alignment for the column header text. Default is as specified by cfgrid.","required":false},"dataalign":{"type":"string","description":"Alignment for column data. Entries are: left, center, or right. Default is as specified \n\t\tby cfgrid.","required":false},"type":{"type":"string","description":"","required":false},"valuesdelimiter":{"type":"string","description":"Character to use as a delimiter in the values and valuesDisplay attributes. Default \n\t\tis \",\" (comma).","required":false},"italic":{"type":"boolean","description":"Yes or No. Yes displays all grid control text in italic. Default is as specified by the \n\t\tcorresponding attribute of cfgrid.","required":false},"hrefkey":{"type":"string","description":"The name of a query column when the grid uses a query. The column specified becomes the Key \n\t\tregardless of the select mode for the grid.","required":false},"font":{"type":"string","description":"Font name to use for data in the column. Defaults is the font specified by cfgrid.","required":false},"select":{"type":"boolean","description":"Yes or No. Yes lets end users select a column in a grid control. When No, the column cannot \n\t\tbe edited, even if the cfgrid insert or delete attributes are enabled. The value of the select \n\t\tattribute is ignored if the cfgrid selectMode attribute is set to Row or Browse.","required":false},"bold":{"type":"boolean","description":"Yes or No. Yes displays all grid control text in boldface. Default is as specified by the \n\t\tcorresponding attribute of cfgrid.","required":false},"width":{"type":"number","description":"The width of the column, in pixels. Default is the width of the column head text.","required":false},"headerfontsize":{"type":"number","description":"Font size to use for the column header, in pixels. Default is as specified by the \n\t\torresponding attribute of cfgrid.","required":false},"display":{"type":"boolean","description":"Yes or No. Use to hide columns. Default is Yes to display the column.","required":false},"headertextcolor":{"type":"string","description":"Color value for the grid control column header text. Entries are: black (default), magenta, \n\t\tcyan, orange, darkgray, pink, gray, white, lightgray, yellow.","required":false},"header":{"type":"string","description":"Text for the column header. The value of header is used only when the cfgrid colHeaders \n\t\tattribute is Yes (or omitted, since it defaults to Yes).","required":false},"mask":{"type":"string","description":"","required":false},"href":{"type":"string","description":"URL to associate with the grid item. You can specify a URL that is relative to the current page","required":false},"numberformat":{"type":"string","description":"The format for displaying numeric data in the grid. For information about mask characters, \n\t\tsee \"numberFormat mask characters\".","required":false},"headerfont":{"type":"string","description":"Font to use for the column header. Default is as specified by the corresponding attribute of \n\t\tcfgrid.","required":false},"fontsize":{"type":"number","description":"Font size for text in the column. Default is the font specified by cfgrid.","required":false},"headeritalic":{"type":"boolean","description":"Yes or No. Yes displays column header text in italic. Default is as specified by the \n\t\tcorresponding attribute of cfgrid.","required":false},"headerbold":{"type":"boolean","description":"Yes or No. Yes displays header text in boldface. Default is as specified by the \n\t\tcorresponding attribute of cfgrid.","required":false},"textcolor":{"type":"string","description":"Color value for grid element text in the grid column, or an expression you can use to manipulate text \n\t\tcolor in grid column elements. Valid color entries are: black (default), magenta, cyan, orange, \n\t\tarkgray, pink, gray, white, lightgray, yellow","required":false},"target":{"type":"string","description":"The name of the frame in which to open the link specified in href.","required":false},"valuesdisplay":{"type":"string","description":"Used to map elements specified in the values attribute to a string of your choice to display \n\t\tin the drop down list. Enter comma separated strings and/or numeric range(s).","required":false},"name":{"type":"string","description":"A name for the grid column element. If the grid uses a query, the column name must specify the \n\t\tname of a query column.","required":true}},"bodyType":"prohibited","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Used with cfgrid in a cfform, you use cfgridcolumn to specify column data in a cfgrid control. Font and alignment \n  attributes used in cfgridcolumn override any global font or alignment settings defined in cfgrid.","attributeType":"fix","parseBody":false}