{"attrMax":0,"name":"http","nameSpace":"cf","attributes":{"addtoken":{"type":"boolean","description":"if yes add urltoken as cookie","required":false},"proxyuser":{"type":"string","description":"When required by a proxy server, a valid username.","required":false},"password":{"type":"string","description":"When required by a server, a valid password.","required":false},"columns":{"type":"string","description":"Specifies the column names for a query when creating a query as a result of a cfhttp GET. \n\tBy default, the first row of a text file is interpreted as column headings. If there are column \n\theaders in the text file from which the query is drawn, do not specify this attribute except to overwrite them. \n\tWhen duplicate column heading names are encountered, ColdFusion appends an underscore character to \n\tthe duplicate column name to make it unique. If there are no column headers in the text file, or to \n\toverride those in the file, you must specify the columns attribute. However ColdFusion never treats \n\tthe first row of the file as data, even if you specify the columns attribute.","required":false},"textqualifier":{"type":"string","description":"Required for creating a query. Indicates the start and finish of a column. Should be \n\tappropriately escaped when embedded in a column. For example, if the qualifier is a double quotation \n\tmark, it should be escaped as \"\"\"\". If there is no text qualifier in the file, specify it as \" \". \n\tDefault is the double quotation mark (\").","required":false},"method":{"type":"string","description":"GET or POST. Use GET to download a text or binary file or to create a query from the contents \n\tof a text file. Use POST to send information to a server page or a CGI program for processing. POST \n\trequires the use of a cfhttpparam tag.","required":false},"charset":{"type":"string","description":"set the charset for the call.","required":false},"username":{"type":"string","description":"When required by a server, a valid username.","required":false},"url":{"type":"string","description":"Full URL of the host name or IP address of the server on which the file resides. The URL must be\n\tan absolute URL, including the protocol (http or https) and hostname. It may optionally contain a port\n\tnumber. Port numbers specified in the url attribute override the port attribute.","required":true},"throwonerror":{"type":"boolean","description":"Boolean indicating whether to throw an exception that can be caught by using the cftry and \n\tcfcatch tags. The default is NO.","required":false},"timeout":{"type":"number","description":"A value, in seconds. When a URL timeout is specified in the browser, the timeout attribute setting \n\t\ttakes precedence over the ColdFusion Administrator timeout. The ColdFusion server then uses the lesser \n\t\tof the URL timeout and the timeout passed in the timeout attribute, so that the request always times \n\t\tout before or at the same time as the page times out. If there is no URL timeout specified, ColdFusion \n\t\ttakes the lesser of the ColdFusion Administrator timeout and the timeout passed in the timeout attribute.\n\t\tIf there is no timeout set on the URL in the browser, no timeout set in the ColdFusion Administrator, \n\t\tand no timeout set with the timeout attribute, ColdFusion waits indefinitely for the cfhttp request to \n\t\tprocess.","required":false},"port":{"type":"number","description":"The port number on the server from which the object is requested. Default is 80. When used with \n\tresolveURL, the URLs of retrieved documents that specify a port number are automatically resolved to \n\tpreserve links in the retrieved document. If a port number is specified in the url attribute, the port\n\tvalue overrides the value of the port attribute.","required":false},"result":{"type":"string","description":"return variable name, default \"cfhhtp\"","required":false},"proxyport":{"type":"number","description":"The port number on the proxy server from which the object is requested. Default is 80. When \n\tused with resolveURL, the URLs of retrieved documents that specify a port number are automatically \n\tresolved to preserve links in the retrieved document.","required":false},"getasbinary":{"type":"string","description":"","required":false},"redirect":{"type":"boolean","description":"Boolean indicating whether to redirect execution or stop execution. The default is Yes. If set \n\tto No and throwOnError = \"yes\", execution stops if cfhttp fails, and the status code and associated \n\terror message are returned in the variable cfhttp.statuscode. To see where execution would have been \n\tredirected, use the variable cfhttp.responseHeader[LOCATION]. The key LOCATION identifies the path of \n\tredirection. ColdFusion will follow up to five redirections on a request. if this limit is exceeded, \n\tColdFusion behaves as if redirect = \"no\".","required":false},"proxypassword":{"type":"string","description":"When required by a proxy server, a valid password.","required":false},"multipart":{"type":"boolean","description":"","required":false},"path":{"type":"string","description":"The path to the directory in which a file is to be stored. If a path is not specified in a POST \n\tor GET operation, a variable is created (cfhttp.fileContent) that you can use to display the results \n\tof the POST operation in a cfoutput.","required":false},"firstrowasheaders":{"type":"boolean","description":"sets if first row of csv is file","required":false},"useragent":{"type":"string","description":"User agent request header.","required":false},"proxyserver":{"type":"string","description":"Host name or IP address of a proxy server.","required":false},"resolveurl":{"type":"boolean","description":"Yes or No. Default is No. For GET and POST operations, if Yes, page reference returned into the \n\tfileContent internal variable has its internal URLs fully resolved, including port number, so that \n\tlinks remain intact.","required":false},"file":{"type":"string","description":"The filename to be used for the file that is accessed. For GET operations, defaults to the name \n\tpecified in url. Enter path information in the path attribute.","required":false},"delimiter":{"type":"string","description":"Required for creating a query. Options are a tab or comma. Default is a comma.","required":false},"name":{"type":"string","description":"The name to assign to a query if the a query is constructed from a file.","required":false}},"bodyType":"free","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Lets you execute HTTP POST and GET operations on files. Using cfhttp, you can execute standard \n  GET operations and create a query object from a text file. POST operations lets you upload MIME file \n  types to a server, or post cookie, formfield, URL, file, or CGI variables directly to a specified server.","attributeType":"fix","parseBody":false}