{"attrMax":0,"name":"image","nameSpace":"cf","attributes":{"thickness":{"type":"number","description":"Border thickness in pixels. The border is added to the outside edge of the source image, increasing the image area accordingly.","required":false},"isbase64":{"type":"boolean","description":"Specifies whether the source is a Base64 string","required":false},"overwrite":{"type":"boolean","description":"If the destination file already exists, ColdFusion generates an error if the overwrite action is not set to yes.","required":false},"fonts":{"type":"string","description":"One or more valid fonts to use for the CAPTCHA text. Separate multiple fonts with commas. ColdFusion supports only the system fonts that the JDK can recognize. For example, TTF fonts in the Windows directory are supported on Windows.","required":false},"structname":{"type":"string","description":"Name of the ColdFusion structure to be created.","required":false},"result":{"type":"string","description":"Name of the ColdFusion structure to be created (alias for structname).","required":false},"quality":{"type":"number","description":"Quality of the JPEG destination file. Applies only to files with an extension of JPG or JPEG. Valid values are fractions that range from 0 through 1 (the lower the number, the lower the quality).","required":false},"text":{"type":"string","description":"Text string displayed in the CAPTCHA image. Use capital letters for better readability. Do not include spaces because users cannot detect them in the resulting CAPTCHA image.","required":false},"height":{"type":"string","description":"Height in pixels of the image.\n\t\t\tFor the resize attribute, you also can specify the height as a percentage.\n\t\t\tWhen you resize an image, if you specify a value for the width.","required":false},"width":{"type":"string","description":"Width in pixels of the image.","required":false},"source":{"type":"any","description":"source file","required":false},"destination":{"type":"string","description":"Absolute or relative pathname where the image output is written. \n\t\t\t\tThe image format is determined by the file extension.\n\t\t\t\tThe convert and write actions require a destination attribute. \n\t\t\t\tThe border, captcha, resize, and rotate actions require a name attribute or a destination attribute. \n\t\t\t\tYou can specify both.\n\t\t\t\tIf you do not enter a destination, \n\t\t\t\tthe CAPTCHA image is placed inline in the HTML output and displayed in the web browser.","required":false},"color":{"type":"string","description":"Border color. Hexadecimal value or supported named color. For a hexadecimal value, use the form \"#xxxxxx\" or \"xxxxxx\", where x = 0-9 or A-F; use two number signs or none.","required":false},"action":{"type":"string","description":"Action to execute. Must be one of the following:\n\t\t\tborder, captcha, convert, info, read, resize, rotate, write, writeToBrowser\n\t\t\tThe default action is read, which you do not need to specify explicitly.","required":false},"format":{"type":"string","description":"Format of the image displayed in the browser. \n\t\t\tIf you do not specify a format, the image is displayed in PNG format.","required":false},"difficulty":{"type":"string","description":"Level of complexity of the CAPTCHA text. \n\t\t\tSpecify one of the following levels of text distortion:\n\t\t\tlow, medium, high","required":false},"angle":{"type":"number","description":"Angle in degrees to rotate the image.","required":false},"fontsize":{"type":"number","description":"font size of the text in the CAPTCHA image.","required":false},"name":{"type":"string","description":"Name of the image variable to create.\n\t\t\tThe read action requires a name attribute.\n\t\t\tThe border, resize, and rotate actions require a name attribute or a destination attribute. \n\t\t\tYou can specify both.","required":false}},"bodyType":"prohibited","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Lets you resize and add labels to GIF and JPEG format images.","attributeType":"fix","parseBody":false}