{"attrMax":0,"name":"ldap","nameSpace":"cf","attributes":{"password":{"type":"string","description":"used when username is defined","required":false},"scope":{"type":"string","description":"Specifies the scope of the search from the entry specified in the Start attribute \n\t\tfor action = \"Query\".","required":false},"sortcontrol":{"type":"string","description":"Specifies how to sort query results.","required":false},"separator":{"type":"string","description":"Specifies the character that cfldap uses to separate attribute values in multi-value attributes. This character is used by the query, add, and modify action attributes, and \n\t\tby cfldap to output multi-value attributes. The default character is the comma (,).","required":false},"username":{"type":"string","description":"If no user name is specified, the LDAP connection is anonymous.","required":false},"start":{"type":"string","description":"Specifies the distinguished name of the entry to be used to start the search.","required":false},"rebind":{"type":"boolean","description":"If you set rebind to Yes, cfldap attempts to rebind the referral callback and reissue the query \n\t\tby the referred address using the original credentials. The default is No, which means referred \n\t\tconnections are anonymous.","required":false},"attributes":{"type":"string","description":"","required":false},"timeout":{"type":"number","description":"Specifies the maximum amount of time, in seconds, to wait for LDAP processing. Defaults to \n\t\t60 seconds.","required":false},"port":{"type":"number","description":"Port defaults to the standard LDAP port, 389.","required":false},"filter":{"type":"string","description":"","required":false},"returnasbinary":{"type":"string","description":"A comma-delimited list of columns that are to be returned as binary values.","required":false},"modifytype":{"type":"string","description":"Indicates whether to add, delete, or replace an attribute in a multi-value list of attributes.","required":false},"server":{"type":"string","description":"Host name \"biff.upperlip.com\" or IP address \"192.1.2.225\" of the LDAP server.","required":true},"dn":{"type":"string","description":"Specifies the distinguished name for update actions.","required":false},"startrow":{"type":"number","description":"Used in conjunction with action = \"Query\". Specifies the first row of the LDAP query to insert \n\t\tinto the ColdFusion query. The default is 1.","required":false},"action":{"type":"string","description":"Specifies the LDAP action.","required":false},"filterfile":{"type":"string","description":"Specifies the name of a filter file and of the stanza tag within the file that contains the \n\t\tLDAP filter string specification. You can specify an absolute pathname or a simple filename to identify \n\t\tthe file.","required":false},"maxrows":{"type":"number","description":"Specifies the maximum number of entries for LDAP queries.","required":false},"sort":{"type":"string","description":"Indicates the attribute or attributes by which to sort query results. Use a comma to separate attributes.","required":false},"delimiter":{"type":"string","description":"Specifies the character that cfldap uses to separate multiple attribute name/value pairs when more than one attribute is specified in the attribute attribute or the attribute that you want to use has the default delimiter character, which is the semicolon (;), such as mgrpmsgrejecttext;lang-en. The delimiter character is used by the query, add, and \n\t\tmodify action attributes, and is used by cfldap to output multi-value attributes","required":false},"referral":{"type":"string","description":"Identifies the type of security to employ, CFSSL_BASIC or CFSSL_CLIENT_AUTH, and additional \n\t\tinformation that is required by the specified security type.","required":false},"name":{"type":"string","description":"The name you assign to the LDAP query.","required":false}},"bodyType":"prohibited","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Provides an interface to LDAP Lightweight Directory Access Protocol \n  directory servers like the Netscape Directory Server.","attributeType":"fix","parseBody":false}