{"attrMax":0,"name":"gridupdate","nameSpace":"cf","attributes":{"datasource":{"type":"string","description":"The name of the data source for the update action.","required":true},"grid":{"type":"string","description":"The name of the cfgrid form element that is the source for the update action.","required":true},"dbname":{"type":"string","description":"The database name (Sybase System 11 driver and SQLOLEDB provider only). If specified, \n\tdbName overrides the default database specified in the data source.","required":false},"tablequalifier":{"type":"string","description":"For data sources that support table qualifiers, use this field to specify the qualifier for the \n\ttable. The purpose of table qualifiers varies across drivers. For SQL Server and Oracle, the qualifier\n\trefers to the name of the database that contains the table. For the Intersolv dBase driver, the qualifier \n\trefers to the directory where the DBF files are located.","required":false},"providerdsn":{"type":"string","description":"Data source name for the COM provider (OLE-DB only).","required":false},"username":{"type":"string","description":"If specified, username overrides the username value specified in the ODBC setup.","required":false},"tablename":{"type":"string","description":"The name of the table to update.","required":true},"keyonly":{"type":"boolean","description":"Yes or No. Yes specifies that in the update action, the WHERE criteria is confined to the key \n\tvalues. No specifies that in addition to the key values, the original values of any changed fields \n\tare included in the WHERE criteria. Default is Yes.","required":false},"dbserver":{"type":"string","description":"For native database drivers and the SQLOLEDB provider, specifies the name of the database \n\tserver computer. If specified, dbServer overrides the server specified in the data source.","required":false},"connectstring":{"type":"string","description":"The contents of a connection string to send to the ODBC server. When connecting to a data \n\tsource defined in the ColdFusion Administrator, you can use this attribute to specify additional \n\tconnection details or to override connection information specified in the Administrator. If you are \n\tdynamically connecting to a datasource by specifying dbType = \"dynamic\", the connection string must \n\tspecify all required ODBC connection attributes.","required":true},"provider":{"type":"string","description":"COM provider (OLE-DB only).","required":false},"tableowner":{"type":"string","description":"For data sources that support table ownership (such as SQL Server, Oracle, and Sybase SQL \n\tAnywhere), use this field to specify the owner of the table.","required":false},"password":{"type":"string","description":"If specified, password overrides the password value specified in the ODBC setup.","required":false},"dbtype":{"type":"string","description":"The database driver type","required":false}},"bodyType":"prohibited","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Used in a cfgrid, cfgridupdate allows you to perform updates to data sources directly from edited \n  grid data. The cfgridupdate tag provides a direct interface with your data source. \n  The cfgridupdate tag applies delete row actions first, then INSERT row actions, and then UPDATE row \n  actions. If an error is encountered, row processing stops.","attributeType":"fix","parseBody":false}