{"attrMax":0,"name":"mail","nameSpace":"cf","attributes":{"wraptext":{"type":"number","description":"Specifies the maximum line length, in characters of the mail text. If a line has more than the specified number of characters, replaces the last white space character, such as a tab or space, preceding the specified position with a line break. If there are no white space characters, inserts a line break at the specified position. A common value for this attribute is 72.","required":false},"proxyuser":{"type":"string","description":"When required by a proxy server, a valid username.","required":false},"password":{"type":"string","description":"A password to send to SMTP servers that require authentication. Requires a username attribute.","required":false},"to":{"type":"string","description":"The name of the e-mail message recipient.","required":true},"spoolenable":{"type":"boolean","description":"","required":false},"charset":{"type":"string","description":"Character encoding of the mail message","required":false},"type":{"type":"string","description":"Specifies extended type attributes for the message.","required":false},"username":{"type":"string","description":"A user name to send to SMTP servers that require authentication. Requires a password attribute.","required":false},"query":{"type":"string","description":"The name of the cfquery from which to draw data for message(s) to send. Specify this \n\t\tattribute to send more than one mail message, or to send the results of a query within a message.","required":false},"subject":{"type":"string","description":"The subject of the mail message. This field may be driven dynamically on \n\t\ta message-by-message basis","required":true},"group":{"type":"string","description":"Specifies the query column to use when you group sets of records together to send as an e-mail \n\t\tmessage. For example, if you send a set of billing statements to customers, you might group on \n\t\t\"Customer_ID.\" The group attribute, which is case sensitive, eliminates adjacent duplicates when the \n\t\tdata is sorted by the specified field. See the Usage section for exceptions.","required":false},"timeout":{"type":"number","description":"The number of seconds to wait before timing out the connection to the SMTP server.","required":false},"groupcasesensitive":{"type":"boolean","description":"Boolean indicating whether to group with regard to case or not. The default value is YES; \n\t\tcase is considered while grouping. If the query attribute specifies a query object that was generated \n\t\tby a case-insensitive SQL query, set the groupCaseSensitive attribute to NO to keep the recordset \n\t\tintact.","required":false},"port":{"type":"number","description":"The TCP/IP port on which the SMTP server listens for requests. This is normally 25.","required":false},"ssl":{"type":"boolean","description":"","required":false},"proxyport":{"type":"number","description":"The port number on the proxy server from which the object is requested. Default is 80. When \n\tused with resolveURL, the URLs of retrieved documents that specify a port number are automatically \n\tresolved to preserve links in the retrieved document.","required":false},"tls":{"type":"boolean","description":"","required":false},"proxypassword":{"type":"string","description":"When required by a proxy server, a valid password.","required":false},"secure":{"type":"boolean","description":"alias for ssl","required":false},"cc":{"type":"string","description":"Indicates addresses to copy the e-mail message to; \"cc\" stands for \"carbon copy.\"","required":false},"server":{"type":"string","description":"The address of the SMTP server to use for sending messages. If no server is specified, the \n\t\tserver name specified in the ColdFusion Administrator is used.","required":false},"from":{"type":"string","description":"The sender of the e-mail message.","required":true},"startrow":{"type":"number","description":"Specifies the row in the query to start from.","required":false},"replyto":{"type":"string","description":"Address(es) to which the recipient is directed to send replies.","required":false},"proxyserver":{"type":"string","description":"Host name or IP address of a proxy server.","required":false},"maxrows":{"type":"number","description":"Specifies the maximum number of e-mail messages to send.","required":false},"bcc":{"type":"string","description":"Indicates addresses to copy the e-mail message to, without listing them in the message header. \n\t\t\"bcc\" stands for \"blind carbon copy.\"","required":false},"mimeattach":{"type":"string","description":"Specifies the path of the file to be attached to the e-mail message. An attached file \n\t\tis MIME-encoded.","required":false},"failto":{"type":"string","description":"Address to which mailing systems should send delivery failure notifications. Sets the mail envelope reverse-path value.","required":false},"usessl":{"type":"boolean","description":"alias for ssl","required":false},"usetls":{"type":"boolean","description":"alias for tls","required":false},"priority":{"type":"String","description":"","required":false},"starttls":{"type":"boolean","description":"alias for tls","required":false},"mailerid":{"type":"string","description":"Specifies a mailer ID to be passed in the X-Mailer SMTP header, which identifies the mailer \n\t\tapplication. The default is ColdFusion Application Server.","required":false}},"bodyType":"required","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Sends e-mail messages by an SMTP server.","attributeType":"fix","parseBody":true}