{"attrMax":0,"name":"query","nameSpace":"cf","attributes":{"password":{"type":"string","description":"If specified, password overrides the password value specified in the data source setup.","required":false},"blockfactor":{"type":"number","description":"Specifies the maximum number of rows to fetch at a time from the server. The range is 1, \n\t\tdefault to 100. This parameter applies to ORACLE native database drivers and to ODBC drivers. \n\t\tCertain ODBC drivers may dynamically reduce the block factor at runtime.","required":false},"username":{"type":"string","description":"If specified, username overrides the username value specified in the data source setup.","required":false},"dbserver":{"type":"string","description":"For native database drivers and the SQLOLEDB provider, specifies the name of the database server \n\t\tcomputer. If specified, dbServer overrides the server specified in the data source.","required":false},"providerdsn":{"type":"string","description":"Data source name for the COM provider, OLE-DB only.","required":false},"datasource":{"type":"string","description":"The name of the data source from which this query should retrieve data.","required":false},"cachedwithin":{"type":"timeSpan","description":"","required":false},"timeout":{"type":"number","description":"The maximum number of milliseconds for the query to execute before returning an error \n\t\tindicating that the query has timed-out. This attribute is not supported by most ODBC drivers. \n\t\ttimeout is supported by the SQL Server 6.x or above driver. The minimum and maximum allowable values \n\t\tvary, depending on the driver.","required":false},"result":{"type":"string","description":"","required":false},"debug":{"type":"boolean","description":"Used for debugging queries. Specifying this attribute causes the SQL statement submitted to the \n\t\tdata source and the number of records returned from the query to be returned.","required":false},"dbname":{"type":"string","description":"The database name, Sybase System 11 driver and SQLOLEDB provider only. If specified, dbName \n\t\toverrides the default database specified in the data source.","required":false},"cachedafter":{"type":"datetime","description":"This is the age of which the query data can be","required":false},"psq":{"type":"boolean","description":"preserve single quote or not","required":false},"cachename":{"type":"string","description":"This is specific to JTags, and allows you to give the cache a specific name","required":false},"connectstring":{"type":"string","description":"The contents of a connection string to send to the ODBC server. When connecting to a data source \n\t\tdefined in the ColdFusion Administrator, you can use this attribute to specify additional connection \n\t\tdetails or to override connection information specified in the Administrator. If you are dynamically \n\t\tconnecting to a datasource by specifying dbType = \"dynamic\", the connection string must specify all \n\t\trequired ODBC connection attributes.","required":false},"maxrows":{"type":"number","description":"Specifies the maximum number of rows to return in the record set.","required":false},"dbtype":{"type":"string","description":"The database driver type.","required":false},"provider":{"type":"string","description":"COM provider, OLE-DB only.","required":false},"name":{"type":"string","description":"The name query. Must begin with a letter and may consist of letters, numbers, and the underscore \n\t\tcharacter, spaces are not allowed. The query name is used later in the page to reference the query's \n\t\trecord set.","required":false}},"bodyType":"required","nameSpaceSeperator":"","hasNameAppendix":false,"attrMin":0,"description":"Passes SQL statements to a data source. Not limited to queries.","attributeType":"fix","parseBody":true}