{"bodyType":"free","attrMax":0,"parseBody":false,"script":{"type":"multiple","rtexpr":true},"status":"implemeted","attrMin":0,"hasNameAppendix":false,"name":"http","type":"java","attributeCollection":true,"attributeType":"fixed","nameSpaceSeperator":"","attributes":{"workstation":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"The workstation the authentication request is originating from. Essentially, the computer name for this machine. this attribute is only used when authenication type is \"NTLM\""},"charset":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"set the charset for the call."},"getasbinary":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"- false: If CFML does not recognize the response body type as text, convert it to a CFML object.\n- auto: If CFML does not recognize the response body type as text, convert it to CFML Binary type data.\n- true: always convert the response body content into CFML Binary type data, even if CFML recognizes the response body type as text."},"throwonerror":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"Boolean indicating whether to throw an exception that can be caught by using the cftry and\n\tcfcatch tags. The default is NO."},"encoded":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"if set to true (default value) URL encodes the value of the attribute \"URL\" if necessary (no double encoding is happeing).\n\t\t\tThis setting has no influence on the values from httpparam type=\"url\", for this use the attribute \"encoded\" from httpparam"},"domain":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"The domain to authenticate within. this attribute is only used when authenication type is \"NTLM\""},"useragent":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"User agent request header."},"addtoken":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"if yes add urltoken as cookie"},"proxyuser":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"When required by a proxy server, a valid username."},"compression":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"Informs the target webserver to disable compression for the response. Possible values are:\n- true (default): compression enabled\n- false: compression disabled\n- none (deprecated): use \"false\" instead"},"url":{"required":true,"status":"implemeted","scriptSupport":"none","type":"string","description":"Full URL of the host name or IP address of the server on which the file resides. The URL must be\n\tan absolute URL, including the protocol (http or https) and hostname. It may optionally contain a port\n\tnumber. Port numbers specified in the url attribute override the port attribute."},"columns":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"Specifies the column names for a query when creating a query as a result of a cfhttp GET."},"password":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"When required by a server, a valid password."},"file":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"The filename to be used for the file that is accessed. For GET operations, defaults to the name\n\tspecified in url. Enter path information in the path attribute."},"firstrowasheaders":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"sets if first row of csv is file"},"textqualifier":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"Required for creating a query. Indicates the start and finish of a column. Should be\n\tappropriately escaped when embedded in a column. For example, if the qualifier is a double quotation\n\tmark, it should be escaped as \"\"\"\". If there is no text qualifier in the file, specify it as \" \".\n\tDefault is the double quotation mark (\")."},"name":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"The name to assign to a query if the a query is constructed from a file."},"timeout":{"required":false,"status":"implemeted","scriptSupport":"none","type":"number","description":"A value, in seconds. When a URL timeout is specified in the browser, the timeout attribute setting\n\t\ttakes precedence over the Railo Administrator timeout. The server then uses the lesser\n\t\tof the URL timeout and the timeout passed in the timeout attribute, so that the request always times\n\t\tout before or at the same time as the page times out. If there is no URL timeout specified, Railo\n\t\ttakes the lesser of the Railo Administrator timeout and the timeout passed in the timeout attribute.\n\t\tIf there is no timeout set on the URL in the browser, no timeout set in the Railo Administrator,\n\t\tand no timeout set with the timeout attribute, Railo waits indefinitely for the cfhttp request to\n\t\tprocess."},"delimiter":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"Required for creating a query. Options are a tab or comma. Default is a comma."},"multipart":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"Tells Railo to send all data specified by cfhttpparam type=\"formField\" tags as multipart form data, with a Content-Type of multipart\/form-data."},"username":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"When required by a server, a valid username."},"result":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"return variable name, default \"cfhhtp\""},"method":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"GET or POST. Use GET to download a text or binary file or to create a query from the contents\n\tof a text file. Use POST to send information to a server page or a CGI program for processing. POST\n\trequires the use of a cfhttpparam tag."},"proxyport":{"required":false,"status":"implemeted","scriptSupport":"none","type":"number","description":"The port number on the proxy server from which the object is requested. Default is 80. When\n\tused with resolveURL, the URLs of retrieved documents that specify a port number are automatically\n\tresolved to preserve links in the retrieved document."},"proxypassword":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"When required by a proxy server, a valid password."},"preauth":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"if set to true (default), Railo sends the basic authentication (username password) always (Preemptive Basic Authentication), \n\t\t\tif set to false the authentication is only send when the server ask for it (status code 401)."},"path":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"The path to the directory in which a file is to be stored. If a path is not specified in a POST\n\tor GET operation, a variable is created (cfhttp.fileContent) that you can use to display the results\n\tof the POST operation in a cfoutput."},"proxyserver":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"Host name or IP address of a proxy server."},"authtype":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"authentication type for a request with username and password, valid values are \"BASIC\" (default) and \"NTLM\""},"multiparttype":{"required":false,"status":"implemeted","scriptSupport":"none","type":"string","description":"alias for multiparttype"},"port":{"required":false,"status":"implemeted","scriptSupport":"none","type":"number","description":"The port number on the server from which the object is requested. Default is 80. When used with\n\tresolveURL, the URLs of retrieved documents that specify a port number are automatically resolved to\n\tpreserve links in the retrieved document. If a port number is specified in the url attribute, the port\n\tvalue overrides the value of the port attribute."},"redirect":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"Boolean indicating whether to redirect execution or stop execution. The default is Yes. If set\n\tto No and throwOnError = \"yes\", execution stops if cfhttp fails, and the status code and associated\n\terror message are returned in the variable cfhttp.statuscode. To see where execution would have been\n\tredirected, use the variable cfhttp.responseHeader[LOCATION]. The key LOCATION identifies the path of\n\tredirection. Railo will follow up to five redirections on a request. if this limit is exceeded,\n\tRailo behaves as if redirect = \"no\"."},"resolveurl":{"required":false,"status":"implemeted","scriptSupport":"none","type":"boolean","description":"Yes or No. Default is No. For GET and POST operations, if Yes, page reference returned into the\n\tfileContent internal variable has its internal URLs fully resolved, including port number, so that\n\tlinks remain intact."}},"description":"Lets you execute HTTP POST and GET operations on files. Using cfhttp, you can execute standard\n  GET operations and create a query object from a text file. POST operations lets you upload MIME file\n  types to a server, or post cookie, formfield, URL, file, or CGI variables directly to a specified server.","nameSpace":"cf"}