{"status":"implemeted","nameSpaceSeperator":"","type":"cfml","script":{"type":"none","rtexpr":false},"nameSpace":"cf","hasNameAppendix":false,"description":"Creates a JavaScript proxy for a component, for use in an AJAX client. Alternatively, creates a proxy for a single CFC method, JavaScript function, or URL that is bound to one or more control attribute values.","parseBody":false,"name":"AjaxProxy","bodyType":"free","attributeType":"fixed","attrMax":0,"attributes":{"onerror":{"status":"implemeted","description":"The name of a JavaScript function to invoke when a bind, specified by the bind attribute fails. The function must take two arguments: an error code and an error message.","required":false,"type":"string","scriptSupport":"none"},"methods":{"status":"implemeted","description":"Comma delimited list of methods name. If exists only the method ( if remote ) specified will be exposed in the proxy object.","required":false,"type":"string","scriptSupport":"none"},"extends":{"status":"implemeted","description":"If true force ajaxproxy to look for remote methods in the cfc extensions chain. Any remote method found will be added to the proxy object. This atrribute cannot be used with a bind attribute.","required":false,"type":"boolean","scriptSupport":"none"},"jsclassname":{"status":"implemeted","description":"The name to use for the JavaScript proxy class.","required":false,"type":"string","scriptSupport":"none"},"bind":{"status":"implemeted","description":"A bind expression that specifies a CFC method, JavaScript function, or URL to call. Cannot be used with the cfc attribute.","required":false,"type":"string","scriptSupport":"none"},"onsuccess":{"status":"implemeted","description":"The name of a JavaScript function to invoke when a bind, specified by the bind attribute succeeds. The function must take one argument, the bind function return value. If the bind function is a CFC function, the return value is automatically converted to a JavaScript variable before being passed to the onSuccess function.","required":false,"type":"string","scriptSupport":"none"},"cfc":{"status":"implemeted","description":"the CFC for which to create a proxy. You must specify a dot-delimited path to the CFC. The path can be absolute or relative to location of the CFML page. For example, if the myCFC CFC is in the cfcs subdirectory of the Railox page, specify cfcs.myCFC. On UNIX based systems, the tag searches first for a file whos name or path corresponds to the specified name or path, but is in all lower case. If it does not find it, Railox then searches for a file name or path that coresponds to the attribute value exactly, with identical character casing.","required":false,"type":"string","scriptSupport":"none"}},"attrMin":0}